tutorials/compressible/rhoPimpleFoam/cavity/0/R
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      R;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform ( 0 0 0 0 0 0 );

boundaryField
{
    movingWall
    {
        type            kqRWallFunction;
        value           uniform ( 0 0 0 0 0 0 );
    }

    fixedWalls
    {
        type            kqRWallFunction;
        value           uniform ( 0 0 0 0 0 0 );
    }

    frontAndBack
    {
        type            empty;
    }
}


// ****************** vim: set ft=foamdict sw=4 sts=4 et: ****************** //
